TMS320C2000 Assembler PC v22.6.1 Tue Jul  2 19:04:17 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v22.6.1.LTS *
       3              ;* Date/Time created: Tue Jul  2 19:04:16 2024                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=eabi --cla_support=cla2 --diag_wrap=off --float_support=fpu32 --hll_source=on --
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../sfra_gui_scicomms_driverlib.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v22.6.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Lenovo\workspace_v13\PCMC_PSFB_F28004x\RELEASE")
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    5580                      .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
    5581                      .dwendtag $C$DW$T$24
    5582              
    5583                      .dwendtag $C$DW$TU$24
    5584              
    5585              
    5586              $C$DW$TU$25     .dwtag  DW_TAG_type_unit
    5587                      .dwmtype  $C$DW$T$25
    5588              $C$DW$T$25      .dwtag  DW_TAG_typedef
    5589                      .dwattr $C$DW$T$25, DW_AT_name("GPIO_Direction")
    5590                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    5591                      .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_5_02_01_00/c2000ware/driverlib/
    5592                      .dwattr $C$DW$T$25, DW_AT_decl_line(0x7e)
    5593                      .dwattr $C$DW$T$25, DW_AT_decl_column(0x03)
    5594              
    5595                      .dwendtag $C$DW$TU$25
    5596              
    5597              
    5598              $C$DW$TU$26     .dwtag  DW_TAG_type_unit
    5599                      .dwmtype  $C$DW$T$26
TMS320C2000 Assembler PC v22.6.1 Tue Jul  2 19:04:17 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  109

    5600              
    5601              $C$DW$T$26      .dwtag  DW_TAG_enumeration_type
    5602                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5603              $C$DW$318       .dwtag  DW_TAG_enumerator
    5604                      .dwattr $C$DW$318, DW_AT_name("GPIO_QUAL_SYNC")
    5605                      .dwattr $C$DW$318, DW_AT_const_value(0x00)
    5606                      .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_5_02_01_00/c2000ware/driverlib/f
    5607                      .dwattr $C$DW$318, DW_AT_decl_line(0x95)
    5608                      .dwattr $C$DW$318, DW_AT_decl_column(0x05)
    5609              
    5610              $C$DW$319       .dwtag  DW_TAG_enumerator
    5611                      .dwattr $C$DW$319, DW_AT_name("GPIO_QUAL_3SAMPLE")
    5612                      .dwattr $C$DW$319, DW_AT_const_value(0x01)
    5613                      .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_5_02_01_00/c2000ware/driverlib/f
    5614                      .dwattr $C$DW$319, DW_AT_decl_line(0x96)
    5615                      .dwattr $C$DW$319, DW_AT_decl_column(0x05)
    5616              
    5617              $C$DW$320       .dwtag  DW_TAG_enumerator
    5618                      .dwattr $C$DW$320, DW_AT_name("GPIO_QUAL_6SAMPLE")
    5619                      .dwattr $C$DW$320, DW_AT_const_value(0x02)
    5620                      .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_5_02_01_00/c2000ware/driverlib/f
    5621                      .dwattr $C$DW$320, DW_AT_decl_line(0x97)
    5622                      .dwattr $C$DW$320, DW_AT_decl_column(0x05)
    5623              
    5624              $C$DW$321       .dwtag  DW_TAG_enumerator
    5625                      .dwattr $C$DW$321, DW_AT_name("GPIO_QUAL_ASYNC")
    5626                      .dwattr $C$DW$321, DW_AT_const_value(0x03)
    5627                      .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_5_02_01_00/c2000ware/driverlib/f
    5628                      .dwattr $C$DW$321, DW_AT_decl_line(0x98)
    5629                      .dwattr $C$DW$321, DW_AT_decl_column(0x05)
    5630              
    5631                      .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_5_02_01_00/c2000ware/driverlib/
    5632                      .dwattr $C$DW$T$26, DW_AT_decl_line(0x94)
    5633                      .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    5634                      .dwendtag $C$DW$T$26
    5635              
    5636                      .dwendtag $C$DW$TU$26
    5637              
    5638              
    5639              $C$DW$TU$27     .dwtag  DW_TAG_type_unit
    5640                      .dwmtype  $C$DW$T$27
    5641              $C$DW$T$27      .dwtag  DW_TAG_typedef
    5642                      .dwattr $C$DW$T$27, DW_AT_name("GPIO_QualificationMode")
    5643                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    5644                      .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/C2000Ware_DigitalPower_SDK_5_02_01_00/c2000ware/driverlib/
    5645                      .dwattr $C$DW$T$27, DW_AT_decl_line(0x99)
    5646                      .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    5647              
    5648                      .dwendtag $C$DW$TU$27
    5649              
    5650              
    5651              $C$DW$TU$23     .dwtag  DW_TAG_type_unit
    5652                      .dwmtype  $C$DW$T$23
    5653              
    5654              $C$DW$T$23      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v22.6.1 Tue Jul  2 19:04:17 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  110

    5655                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
    5656              $C$DW$322       .dwtag  DW_TAG_member
    5657                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$20)
    5658                      .dwattr $C$DW$322, DW_AT_name("h_magVect")
    5659                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    5660                      .dwattr $C$DW$322, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5661                      .dwattr $C$DW$322, DW_AT_decl_line(0x40)
    5662                      .dwattr $C$DW$322, DW_AT_decl_column(0x10)
    5663              
    5664              $C$DW$323       .dwtag  DW_TAG_member
    5665                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$20)
    5666                      .dwattr $C$DW$323, DW_AT_name("h_phaseVect")
    5667                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5668                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    5669                      .dwattr $C$DW$323, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5670                      .dwattr $C$DW$323, DW_AT_decl_line(0x41)
    5671                      .dwattr $C$DW$323, DW_AT_decl_column(0x10)
    5672              
    5673              $C$DW$324       .dwtag  DW_TAG_member
    5674                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$20)
    5675                      .dwattr $C$DW$324, DW_AT_name("gh_magVect")
    5676                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5677                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    5678                      .dwattr $C$DW$324, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5679                      .dwattr $C$DW$324, DW_AT_decl_line(0x42)
    5680                      .dwattr $C$DW$324, DW_AT_decl_column(0x10)
    5681              
    5682              $C$DW$325       .dwtag  DW_TAG_member
    5683                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$20)
    5684                      .dwattr $C$DW$325, DW_AT_name("gh_phaseVect")
    5685                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5686                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    5687                      .dwattr $C$DW$325, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5688                      .dwattr $C$DW$325, DW_AT_decl_line(0x43)
    5689                      .dwattr $C$DW$325, DW_AT_decl_column(0x10)
    5690              
    5691              $C$DW$326       .dwtag  DW_TAG_member
    5692                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$20)
    5693                      .dwattr $C$DW$326, DW_AT_name("cl_magVect")
    5694                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5695                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    5696                      .dwattr $C$DW$326, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5697                      .dwattr $C$DW$326, DW_AT_decl_line(0x44)
    5698                      .dwattr $C$DW$326, DW_AT_decl_column(0x10)
    5699              
    5700              $C$DW$327       .dwtag  DW_TAG_member
    5701                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$20)
    5702                      .dwattr $C$DW$327, DW_AT_name("cl_phaseVect")
    5703                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5704                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    5705                      .dwattr $C$DW$327, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5706                      .dwattr $C$DW$327, DW_AT_decl_line(0x45)
    5707                      .dwattr $C$DW$327, DW_AT_decl_column(0x10)
    5708              
    5709              $C$DW$328       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v22.6.1 Tue Jul  2 19:04:17 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  111

    5710                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$20)
    5711                      .dwattr $C$DW$328, DW_AT_name("freqVect")
    5712                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5713                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    5714                      .dwattr $C$DW$328, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5715                      .dwattr $C$DW$328, DW_AT_decl_line(0x46)
    5716                      .dwattr $C$DW$328, DW_AT_decl_column(0x10)
    5717              
    5718              $C$DW$329       .dwtag  DW_TAG_member
    5719                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    5720                      .dwattr $C$DW$329, DW_AT_name("amplitude")
    5721                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5722                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    5723                      .dwattr $C$DW$329, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5724                      .dwattr $C$DW$329, DW_AT_decl_line(0x47)
    5725                      .dwattr $C$DW$329, DW_AT_decl_column(0x0f)
    5726              
    5727              $C$DW$330       .dwtag  DW_TAG_member
    5728                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    5729                      .dwattr $C$DW$330, DW_AT_name("isrFreq")
    5730                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5731                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    5732                      .dwattr $C$DW$330, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5733                      .dwattr $C$DW$330, DW_AT_decl_line(0x48)
    5734                      .dwattr $C$DW$330, DW_AT_decl_column(0x0f)
    5735              
    5736              $C$DW$331       .dwtag  DW_TAG_member
    5737                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    5738                      .dwattr $C$DW$331, DW_AT_name("freqStart")
    5739                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5740                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    5741                      .dwattr $C$DW$331, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5742                      .dwattr $C$DW$331, DW_AT_decl_line(0x49)
    5743                      .dwattr $C$DW$331, DW_AT_decl_column(0x0f)
    5744              
    5745              $C$DW$332       .dwtag  DW_TAG_member
    5746                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    5747                      .dwattr $C$DW$332, DW_AT_name("freqStep")
    5748                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5749                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    5750                      .dwattr $C$DW$332, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5751                      .dwattr $C$DW$332, DW_AT_decl_line(0x4a)
    5752                      .dwattr $C$DW$332, DW_AT_decl_column(0x0f)
    5753              
    5754              $C$DW$333       .dwtag  DW_TAG_member
    5755                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$22)
    5756                      .dwattr $C$DW$333, DW_AT_name("start")
    5757                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5758                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    5759                      .dwattr $C$DW$333, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5760                      .dwattr $C$DW$333, DW_AT_decl_line(0x4b)
    5761                      .dwattr $C$DW$333, DW_AT_decl_column(0x0d)
    5762              
    5763              $C$DW$334       .dwtag  DW_TAG_member
    5764                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v22.6.1 Tue Jul  2 19:04:17 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  112

    5765                      .dwattr $C$DW$334, DW_AT_name("state")
    5766                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5767                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    5768                      .dwattr $C$DW$334, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5769                      .dwattr $C$DW$334, DW_AT_decl_line(0x4c)
    5770                      .dwattr $C$DW$334, DW_AT_decl_column(0x0d)
    5771              
    5772              $C$DW$335       .dwtag  DW_TAG_member
    5773                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$22)
    5774                      .dwattr $C$DW$335, DW_AT_name("status")
    5775                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5776                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    5777                      .dwattr $C$DW$335, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5778                      .dwattr $C$DW$335, DW_AT_decl_line(0x4d)
    5779                      .dwattr $C$DW$335, DW_AT_decl_column(0x0d)
    5780              
    5781              $C$DW$336       .dwtag  DW_TAG_member
    5782                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$22)
    5783                      .dwattr $C$DW$336, DW_AT_name("vecLength")
    5784                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5785                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    5786                      .dwattr $C$DW$336, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5787                      .dwattr $C$DW$336, DW_AT_decl_line(0x4e)
    5788                      .dwattr $C$DW$336, DW_AT_decl_column(0x0d)
    5789              
    5790              $C$DW$337       .dwtag  DW_TAG_member
    5791                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$22)
    5792                      .dwattr $C$DW$337, DW_AT_name("freqIndex")
    5793                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5794                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    5795                      .dwattr $C$DW$337, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5796                      .dwattr $C$DW$337, DW_AT_decl_line(0x4f)
    5797                      .dwattr $C$DW$337, DW_AT_decl_column(0x0d)
    5798              
    5799              $C$DW$338       .dwtag  DW_TAG_member
    5800                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$22)
    5801                      .dwattr $C$DW$338, DW_AT_name("storeH")
    5802                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    5803                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    5804                      .dwattr $C$DW$338, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5805                      .dwattr $C$DW$338, DW_AT_decl_line(0x50)
    5806                      .dwattr $C$DW$338, DW_AT_decl_column(0x0d)
    5807              
    5808              $C$DW$339       .dwtag  DW_TAG_member
    5809                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$22)
    5810                      .dwattr $C$DW$339, DW_AT_name("storeGH")
    5811                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5812                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    5813                      .dwattr $C$DW$339, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5814                      .dwattr $C$DW$339, DW_AT_decl_line(0x51)
    5815                      .dwattr $C$DW$339, DW_AT_decl_column(0x0d)
    5816              
    5817              $C$DW$340       .dwtag  DW_TAG_member
    5818                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$22)
    5819                      .dwattr $C$DW$340, DW_AT_name("storeCL")
TMS320C2000 Assembler PC v22.6.1 Tue Jul  2 19:04:17 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  113

    5820                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    5821                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    5822                      .dwattr $C$DW$340, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5823                      .dwattr $C$DW$340, DW_AT_decl_line(0x52)
    5824                      .dwattr $C$DW$340, DW_AT_decl_column(0x0d)
    5825              
    5826              $C$DW$341       .dwtag  DW_TAG_member
    5827                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$22)
    5828                      .dwattr $C$DW$341, DW_AT_name("speed")
    5829                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    5830                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    5831                      .dwattr $C$DW$341, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/sf
    5832                      .dwattr $C$DW$341, DW_AT_decl_line(0x53)
    5833                      .dwattr $C$DW$341, DW_AT_decl_column(0x0d)
    5834              
    5835                      .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/s
    5836                      .dwattr $C$DW$T$23, DW_AT_decl_line(0x3f)
    5837                      .dwattr $C$DW$T$23, DW_AT_decl_column(0x0f)
    5838                      .dwendtag $C$DW$T$23
    5839              
    5840                      .dwendtag $C$DW$TU$23
    5841              
    5842              
    5843              $C$DW$TU$28     .dwtag  DW_TAG_type_unit
    5844                      .dwmtype  $C$DW$T$28
    5845              $C$DW$T$28      .dwtag  DW_TAG_typedef
    5846                      .dwattr $C$DW$T$28, DW_AT_name("SFRA_F32")
    5847                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$23)
    5848                      .dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/Lenovo/workspace_v13/PCMC_PSFB_F28004x/libraries/sfra/s
    5849                      .dwattr $C$DW$T$28, DW_AT_decl_line(0x54)
    5850                      .dwattr $C$DW$T$28, DW_AT_decl_column(0x02)
    5851              
    5852                      .dwendtag $C$DW$TU$28
    5853              
    5854              
    5855              $C$DW$TU$29     .dwtag  DW_TAG_type_unit
    5856                      .dwmtype  $C$DW$T$29
    5857              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    5858                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    5859                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    5860              
    5861                      .dwendtag $C$DW$TU$29
    5862              
    5863              
    5864              $C$DW$TU$30     .dwtag  DW_TAG_type_unit
    5865                      .dwmtype  $C$DW$T$30
    5866              $C$DW$342       .dwtag  DW_TAG_TI_far_type
    5867                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$29)
    5868              
    5869              $C$DW$T$30      .dwtag  DW_TAG_const_type
    5870                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$342)
    5871              
    5872                      .dwendtag $C$DW$TU$30
    5873              
    5874              
TMS320C2000 Assembler PC v22.6.1 Tue Jul  2 19:04:17 2024

Copyright (c) 1996-2018 Texas Instruments Incorporated
sfra_gui_scicomms_driverlib.asm                                      PAGE  114

    5875              $C$DW$TU$2      .dwtag  DW_TAG_type_unit
    5876                      .dwmtype  $C$DW$T$2
    5877              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    5878                      .dwattr $C$DW$T$2, DW_AT_name("void")
    5879              
    5880                      .dwendtag $C$DW$TU$2
    5881              
    5882              
    5883              $C$DW$TU$51     .dwtag  DW_TAG_type_unit
    5884                      .dwmtype  $C$DW$T$51
    5885              
    5886              $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
    5887                      .dwendtag $C$DW$T$51
    5888              
    5889                      .dwendtag $C$DW$TU$51
    5890              
    5891              
    5892              $C$DW$TU$52     .dwtag  DW_TAG_type_unit
    5893                      .dwmtype  $C$DW$T$52
    5894              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    5895                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    5896                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    5897              
    5898                      .dwendtag $C$DW$TU$52
    5899              
    5900              
